fonecmid-diplom/src/Documents/ВКМ_ОбслуживаниеКлиента/ВКМ_ОбслуживаниеКлиента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ОбслуживаниеКлиента</name>
  <registerRecords>AccumulationRegister.ВКМ_ВыполненныеКлиентуРаботы</registerRecords>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>Специалист</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПроведенияРабот</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяНачалаРаботПлан</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяОкончанияРаботПлан</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеПроблемы</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаЧасовКОплатеПоДокументу</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ВыполненныеРаботы</name>
    <attributes>
      <name>ОписаниеРабот</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ФактическиПотраченоЧасов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЧасыКОплатеКлиенту</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/Documents/ВКМ_ОбслуживаниеКлиента/Forms/ФормаДокумента/Module.bsl
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ДанныеДляЭлементаСправочника = ВКМ_ДанныеДляЭлементаСправочника();
	Если Не Объект.Ссылка.Пустая() Тогда
		ЕстьИзменения = ВКМ_ПроверитьИзменения(ДанныеДляЭлементаСправочника);
    	Если Не ЕстьИзменения Тогда  		
    		Возврат;
    	КонецЕсли;
    	Преамбула = СтрШаблон("В заявке %1 изменения:", ТекущийОбъект);
    	//НоваяЗаявка = Ложь;	
	Иначе
		Преамбула = СтрШаблон("Создана новая заявка на обслуживание:");
		//НоваяЗаявка = Истина;
		ЗаполнитьЗначенияСвойств(ДанныеДляЭлементаСправочника, Объект);		
	КонецЕсли;
	
	ДанныеДляЭлементаСправочника.Преамбула = Преамбула;
	//ДанныеДляЭлементаСправочника.Новая = НоваяЗаявка;
	//ДанныеДляЭлементаСправочника = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ТекущийОбъект.Ссылка, "ДатаПроведенияРабот,ВремяНачалаРаботПлан,ВремяОкончанияРаботПлан,Специалист,Клиент,ОписаниеПроблемы");
	ВКМ_СоздатьЭлементСправочникаСУведомлениямиТелеграмБотуНаСервере(ДанныеДляЭлементаСправочника);
КонецПроцедуры

Функция ВКМ_ПроверитьИзменения(ДанныеДляЭлементаСправочника) Экспорт
	ЕстьИзменения = Ложь;
	СтарыеЗначения = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект.Ссылка, "ДатаПроведенияРабот,ВремяНачалаРаботПлан,ВремяОкончанияРаботПлан,Специалист");
    Если СтарыеЗначения.ДатаПроведенияРабот <> Объект.ДатаПроведенияРабот Тогда
        ЕстьИзменения = Истина;
        ДанныеДляЭлементаСправочника.ДатаПроведенияРабот = Объект.ДатаПроведенияРабот; 
    КонецЕсли;
    Если СтарыеЗначения.ВремяНачалаРаботПлан <> Объект.ВремяНачалаРаботПлан Тогда
        ЕстьИзменения = Истина;
        ДанныеДляЭлементаСправочника.ВремяНачалаРаботПлан = Объект.ВремяНачалаРаботПлан; 
    КонецЕсли;
    Если СтарыеЗначения.ВремяОкончанияРаботПлан <> Объект.ВремяОкончанияРаботПлан Тогда
        ЕстьИзменения = Истина;
        ДанныеДляЭлементаСправочника.ВремяОкончанияРаботПлан = Объект.ВремяОкончанияРаботПлан; 
    КонецЕсли;
    Если СтарыеЗначения.Специалист <> Объект.Специалист Тогда
        ЕстьИзменения = Истина;
        ДанныеДляЭлементаСправочника.Специалист = Объект.Специалист;
    КонецЕсли;
    Возврат ЕстьИзменения;
КонецФункции

Функция ВКМ_ДанныеДляЭлементаСправочника()
	Результат = Новый Структура;
	//Результат.Вставить("Новая");
	Результат.Вставить("Преамбула");
	Результат.Вставить("Клиент");
	Результат.Вставить("ДатаПроведенияРабот");
	Результат.Вставить("ВремяНачалаРаботПлан");
	Результат.Вставить("ВремяОкончанияРаботПлан");
	Результат.Вставить("Специалист");
	Возврат Результат;
КонецФункции

Процедура ВКМ_СоздатьЭлементСправочникаСУведомлениямиТелеграмБотуНаСервере(ДанныеДляЭлементаСправочника)
	
	УведомлениеСсылка = Справочники.ВКМ_УведомленияТелеграмБотуДляОтправки.ВКМ_СоздатьЭлементСправочникаСУведомлениямиТелеграмБоту(ДанныеДляЭлементаСправочника);
	Если Не УведомлениеСсылка = Справочники.ВКМ_УведомленияТелеграмБотуДляОтправки.ПустаяСсылка() Тогда
		ТекстСообщения = СтрШаблон("Создано уведомление телеграм-боту");
	Иначе
		ТекстСообщения = СтрШаблон("Ошибка при создании уведомления телеграм-боту");
	КонецЕсли;
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
КонецПроцедуры

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
    // СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
    // СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
    ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
    Оповестить("ДокументОбслуживаниеКлиентаЗаписан");
КонецПроцедуры

#КонецОбласти

#Область ПодключаемыеКоманды

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
    ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
    ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
    ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти
